Repository: WoohyunKim-goodhap/SwitchScanner_v3.2
Catalog: switchPriceKana/*.lproj/Localizable.strings
Languages: ar, de, es, fr, ja, ko, ru, vi, zh_hans

# AlarmViewController.showSuccess.head
source: Price alarm start
ar: بدء إنذار السعر
de: Preisalarm starten
es: Inicio de alarma de precio
fr: Début de l'alarme de prix
ja: 価格アラーム開始
ko: 가격 알람 시작
ru: Начало тревоги по цене
vi: Báo giá bắt đầu
zh_hans: 价格报警开始

# AlarmViewController.showSuccess.sub
source: When the target price is reached, we will send you a push notification
ar: عندما يتم الوصول إلى السعر المستهدف ، سنرسل إليك إشعارًا بالدفع
de: Wenn das Kursziel erreicht ist, senden wir Ihnen eine Push-Benachrichtigung
es: Cuando se alcance el precio objetivo, le enviaremos una notificación push
fr: Lorsque le prix cible est atteint, nous vous enverrons une notification push
ja: 目標価格に達すると、プッシュ通知を送信します
ko: 목표 가격에 도달하면 푸시 알림을 보내드립니다
ru: Когда целевая цена будет достигнута, мы отправим вам push-уведомление
vi: Khi đạt được giá mục tiêu, chúng tôi sẽ gửi cho bạn một thông báo đẩy
zh_hans: 达到目标价格后，我们会向您发送推送通知

# AlarmViewController.showError.head
source: Target price empty
ar: السعر المستهدف فارغ
de: Zielpreis leer
es: Precio objetivo vacío
fr: Prix cible vide
ja: 目標価格が空
ko: 목표 가격이 비어 있습니다
ru: Целевая цена пуста
vi: Giá mục tiêu trống
zh_hans: 目标价为空

# AlarmViewController.showError.sub
source: Please fill in price target
ar: يرجى ملء السعر المستهدف
de: Bitte geben Sie das Kursziel ein
es: Por favor complete el precio objetivo
fr: Veuillez remplir l'objectif de prix
ja: 価格目標を記入してください
ko: 목표 가격을 입력하세요
ru: Пожалуйста, укажите целевую цену
vi: Vui lòng điền vào mục tiêu giá
zh_hans: 请填写价格目标

# AlarmViewController.selectedGame
source: Selected Game
ar: لعبة مختارة
de: Ausgewähltes Spiel
es: Juego seleccionado
fr: Jeu sélectionné
ja: 選択したゲーム
ko: 선택한 게임
ru: Выбранная игра
vi: Trò chơi đã chọn
zh_hans: 入选游戏

# AlarmViewController.currentPrice
source: Current Price
ar: السعر الحالي
de: Derzeitiger Preis
es: Precio actual
fr: Prix actuel
ja: 現在の価格
ko: 현재 가격
ru: Текущая цена
vi: Giá hiện tại
zh_hans: 时价

# AlarmViewController.TargetPrice
source: Target Price
ar: السعر المستهدف
de: Zielpreis
es: Precio objetivo
fr: Prix cible
ja: 目標価格
ko: 목표 가격
ru: Целевая цена
vi: Giá mục tiêu
zh_hans: 目标价

# AlarmViewController.alarmRequestButton
source: Alarm Save
ar: حفظ التنبيه
de: Alarm speichern
es: Guardar alarma
fr: Sauvegarde d'alarme
ja: アラーム保存
ko: 알람 저장
ru: Тревога Сохранить
vi: Lưu báo thức
zh_hans: 报警保存

# SwitchViewController.SCalert.findInMenu
source: The current lowest price has been saved in Menu-Save We will send you the current price by push alarm To change the game that receives the alarm, search for a new game and turn the alarm off and then back on.
ar: تم حفظ السعر الأدنى الحالي في Menu-Save. سوف نرسل لك السعر الحالي عن طريق إنذار الدفع. لتغيير اللعبة التي تتلقى التنبيه ، ابحث عن لعبة جديدة وأوقف تشغيل المنبه ثم أعد تشغيله.
de: Der aktuell niedrigste Preis wurde in Menü-Speichern gespeichert Wir senden Ihnen den aktuellen Preis per Push-Alarm Um das Spiel zu ändern, das den Alarm erhält suchen Sie nach einem neuen Spiel und schalten Sie den Alarm aus und wieder ein.
es: El precio más bajo actual se ha guardado en Menú-Guardar/n Le enviaremos el precio actual mediante alarma push Para cambiar el juego que recibe la alarma, busque un nuevo juego apague la alarma y vuelva a encenderla.
fr: Le prix le plus bas actuel a été enregistré dans Menu-Enregistrer Nous vous enverrons le prix actuel par alarme push Pour changer le jeu qui reçoit l'alarme recherchez un nouveau jeu et désactivez puis rallumez l'alarme.
ja: 現在の最低価格はメニュー-保存に保存されています プッシュアラームで現在の価格をお送りします アラームを受信するゲームを変更するには 新しいゲームを検索し、アラームをオフにしてからオンに戻します。
ko: Menu-Save에 현재 최저가격이 저장되었습니다 푸시알람으로 가격을 보내드립니다 알람을 받는 게임을 변경하려면 새로운 게임을 검색한 후 알람을 껐다가 다시 켜주세요
ru: Текущая самая низкая цена была сохранена в Меню-Сохранить. Мы отправим вам текущую цену с помощью push-уведомления. Чтобы изменить игру, которая получает сигнал тревоги, найдите новую игру, выключите и снова включите будильник.
vi: Текущая самая низкая цена была сохранена в Меню-Сохранить Мы отправим вам текущую цену с помощью push-уведомления Чтобы изменить игру, которая получает сигнал тревоги, найдите новую игру, выключите и снова включите будильник.
zh_hans: 当前的最低价格已保存在菜单保存中 我们将通过推送警报向您发送当前价格 要更改接收警报的游戏 请搜索新游戏并关闭警报，然后再打开。

# SwitchViewController.seachBar.Placeholder
source: Input game title or Find game in menu
ar: أدخل عنوان اللعبة أو ابحث عن اللعبة في القائمة
de: Geben Sie den Spieltitel oder das Spiel im Menü suchen ein
es: Ingrese el título del juego o Buscar juego en el menú
fr: Saisissez le titre du jeu ou recherchez le jeu dans le menu
ja: ゲームタイトルを入力するか、メニューでゲームを検索します
ko: 영어로 입력하거나,Menu-Find에서 찾으세요
ru: Введите название игры или найдите игру в меню
vi: Nhập tiêu đề trò chơi hoặc Tìm trò chơi trong menu
zh_hans: 输入游戏标题或在菜单中查找游戏

# SwitchViewController.SCalert.Error
source: No result
ar: لا نتيجة
de: Kein Ergebnis
es: Sin resultados
fr: Pas de résultat
ja: 検索結果はありません
ko: 검색 결과가 없습니다
ru: Безрезультатно
vi: Không kết quả
zh_hans: 没有结果

# SwitchViewController.SCalert.ErrorDetail
source: You better use Menu-Find
ar: من الأفضل لك استخدام قائمة البحث
de: Verwenden Sie besser Menu-Find
es: Es mejor que uses Menú-Buscar
fr: Vous feriez mieux d'utiliser Menu-Find
ja: メニュー検索を使用する方がよい
ko: Menu-Find를 이용하세요
ru: Вам лучше использовать Menu-Find
vi: Tốt hơn bạn nên sử dụng Menu-Find
zh_hans: 您最好使用菜单查找

# WebChartViewController.goToChart.text
source: Go To Chart
ar: اذهب إلى الرسم البياني
de: Gehe zum Diagramm
es: Ir al gráfico
fr: Aller au graphique
ja: チャートに移動
ko: 그래프 보기
ru: Перейти к диаграмме
vi: Đi tới biểu đồ
zh_hans: 转到图表

# WebChartViewController.errorGuideLabel.text
source: If the graph does not appear after pressing the button, go to the previous screen and try again.
ar: إذا لم يظهر الرسم البياني بعد الضغط على الزر ، فانتقل إلى الشاشة السابقة وحاول مرة أخرى.
de: Wenn das Diagramm nach dem Drücken der Taste nicht angezeigt wird, wechseln Sie zum vorherigen Bildschirm und versuchen Sie es erneut.
es: Si el gráfico no aparece después de presionar el botón, vaya a la pantalla anterior y vuelva a intentarlo.
fr: Si le graphique n'apparaît pas après avoir appuyé sur le bouton, revenez à l'écran précédent et réessayez.
ja: ボタンを押してもグラフが表示されない場合は、前の画面に戻ってやり直してください。
ko: 버튼을 눌러도 그래프가 나오지 않으면 이전 화면으로 이동 후 다시 시도해주세요
ru: Если после нажатия кнопки график не появляется, перейдите к предыдущему экрану и попробуйте еще раз.
vi: Nếu biểu đồ không xuất hiện sau khi nhấn nút, hãy chuyển đến màn hình trước đó và thử lại.
zh_hans: 如果按下按钮后图形仍未出现，请转到上一个屏幕，然后重试。

# DetalViewController.textView.text
source: How to buy a game with an account with another country 1. Set up your country in account. -Go to https://accounts.nintendo.com. -login. -if you don't have an account, create one. 2. Edit ‘User Info’ above → Country/Region. 3. Change country that you want. 4. Prepare a credit card for international. 5. Enter the eShop from the Nintendo game console. And you will have to login again to changed country. 6. The language will be changed to corresponding country. Get help with Google Translator.After purchasing the game, it will be available on the console in the original language. 7. Find the game and complete the payment by international credit card at the eShop in the console. 8. You can download the game in the home screen.
ar: كيف تشتري لعبة بحساب في دولة أخرى 1. قم بإعداد حساب بلدك. -الذهاب إلى https://accounts.nintendo.com. -تسجيل الدخول. - إذا لم يكن لديك حساب ، قم بإنشاء حساب. 2. قم بتحرير 'معلومات المستخدم' أعلاه → البلد / المنطقة. 3. تغيير البلد الذي تريده. 4. تجهيز بطاقة ائتمان دولية. 5. ادخل إلى متجر eShop من وحدة تحكم ألعاب Nintendo. وسيتعين عليك تسجيل الدخول مرة أخرى لتغيير البلد. 6. سيتم تغيير اللغة إلى البلد المقابل. احصل على مساعدة بشأن Google Translator. بعد شراء اللعبة ، ستكون متاحة على وحدة التحكم باللغة الأصلية. 7. ابحث عن اللعبة وأكمل الدفع ببطاقة الائتمان الدولية في متجر eShop في وحدة التحكم. 8. يمكنك تنزيل اللعبة على الشاشة الرئيسية.
de: So kaufen Sie ein Spiel mit einem Konto in einem anderen Land 1. Richten Sie Ihr Konto ein. -Gehen Sie zu https://accounts.nintendo.com. -Anmeldung. -Wenn Sie kein Konto haben, erstellen Sie eines. 2. Bearbeiten Sie oben 'Benutzerinformationen' → Land / Region. 3. Ändern Sie das gewünschte Land. 4. Bereiten Sie eine Kreditkarte für international vor. 5. Rufen Sie den eShop über die Nintendo-Spielekonsole auf. Und Sie müssen sich erneut in das geänderte Land einloggen. 6. Die Sprache wird in das entsprechende Land geändert. Holen Sie sich Hilfe zu Google Übersetzer. Nach dem Kauf des Spiels ist es in der Originalsprache auf der Konsole verfügbar. 7. Finden Sie das Spiel und schließen Sie die Zahlung mit internationaler Kreditkarte im eShop in der Konsole ab. 8. Sie können das Spiel auf dem Startbildschirm herunterladen.
es: Cómo comprar un juego con una cuenta en otro país 1. Configure su país en la cuenta. -Vaya a https://accounts.nintendo.com. -iniciar sesión. -si no tiene una cuenta, cree una. 2. Edite 'Información de usuario' arriba → País / Región. 3. Cambie el país que desee. 4. Prepare una tarjeta de crédito para internacionales. 5. Ingrese a la eShop desde la consola de juegos de Nintendo. Y tendrá que volver a iniciar sesión para cambiar de país. 6. El idioma se cambiará al país correspondiente. Obtén ayuda con Google Translator. Después de comprar el juego, estará disponible en la consola en el idioma original. 7. Busque el juego y complete el pago con tarjeta de crédito internacional en la eShop de la consola. 8. Puede descargar el juego en la pantalla de inicio.
fr: Comment acheter un jeu avec un compte dans un autre pays 1. Configurez votre pays dans le compte. -Allez sur https://accounts.nintendo.com. -s'identifier. -si vous n'avez pas de compte, créez-en un. 2. Modifiez «Info utilisateur» ci-dessus → Pays / Région. 3. Changez le pays de votre choix. 4. Préparez une carte de crédit pour l'international. 5. Entrez dans l'eShop à partir de la console de jeu Nintendo. Et vous devrez vous reconnecter au pays changé. 6. La langue sera remplacée par le pays correspondant. Obtenez de l'aide avec Google Translator. Après l'achat du jeu, il sera disponible sur la console dans la langue d'origine. 7. Trouvez le jeu et effectuez le paiement par carte de crédit internationale sur l'eShop de la console. 8. Vous pouvez télécharger le jeu sur l'écran d'accueil.
ja: 他の国のアカウントでゲームを購入する方法 1.アカウントに国を設定します。 -https：//accounts.nintendo.comにアクセスします。 -ログインする。 -アカウントをお持ちでない場合は、アカウントを作成してください。 2.上記の「ユーザー情報」→国/地域を編集します。 3.希望する国を変更します。 4.国際向けのクレジットカードを準備します。 5.ニンテンドーゲームコンソールからeショップに入ります。 また、変更した国に再度ログインする必要があります。 6.言語は対応する国に変更されます。 Google翻訳のサポートを受けてください。ゲームを購入すると、コンソールで元の言語で利用できるようになります。 7.ゲームを見つけて、コンソールのeショップで国際クレジットカードによる支払いを完了します。 8.ホーム画面でゲームをダウンロードできます。
ko: 다른 국가 계정으로 게임 구매하는 방법 1. 해당 국가 계정 설정 -https://accounts.nintendo.com 으로 이동 -로그인. 만약 계정이 없으면 새로 만듭니다 2. 위에 있는 유저 정보 편집 → 국가/지역 3. 원하는 국가로 변경 4. 해당 국가에서 사용할 수 있는 신용카드 준비 5. 닌텐도 게임기에서 eShop으로 들어가면 해당국가로 다시 로그인하게 됩니다 6. 언어가 해당 국가 언어로 바뀌게 되는데 구글 번역기로 도움을 받으세요^^ 게임 구매 후 게임기에서 원래 언어로 사용 가능합니다 7. 해당국가 eShop에서 원하는 게임을 찾고 해외 신용카드로 결제 8. 콘솔 홈화면에서 다운로드하면 완료
ru: Как купить игру со счетом в другой стране 1. Настройте свою страну в учетной записи. -Перейдите на https://accounts.nintendo.com. -авторизоваться. -если у вас нет учетной записи, создайте ее. 2. Измените «Информация о пользователе» выше → Страна / регион. 3. Измените страну, которую хотите. 4. Подготовьте кредитную карту для международной. 5. Войдите в интернет-магазин с игровой консоли Nintendo. И вам придется снова войти в систему, чтобы изменить страну. 6. Язык будет изменен на соответствующую страну. Получите помощь с Google Переводчиком. После покупки игры она будет доступна на консоли на языке оригинала. 7. Найдите игру и произведите оплату с помощью международной кредитной карты в интернет-магазине на консоли. 8. Вы можете скачать игру на главном экране.
vi: Cách mua game bằng tài khoản ở quốc gia khác 1. Thiết lập quốc gia của bạn trong tài khoản. -Truy cập https://accounts.nintendo.com. -đăng nhập. -nếu bạn chưa có tài khoản, hãy tạo một tài khoản. 2. Chỉnh sửa ‘Thông tin người dùng’ ở trên → Quốc gia / Khu vực. 3. Thay đổi quốc gia mà bạn muốn. 4. Chuẩn bị một thẻ tín dụng cho quốc tế. 5. Vào eShop từ bảng điều khiển trò chơi Nintendo. Và bạn sẽ phải đăng nhập lại vào quốc gia đã thay đổi. 6. Ngôn ngữ sẽ được thay đổi thành quốc gia tương ứng. Nhận trợ giúp với Google Translator. Sau khi mua trò chơi, trò chơi sẽ có sẵn trên bảng điều khiển bằng ngôn ngữ gốc. 7. Tìm trò chơi và hoàn tất thanh toán bằng thẻ tín dụng quốc tế tại eShop trong bảng điều khiển. 8. Bạn có thể tải xuống trò chơi trong màn hình chính.
zh_hans: 如何使用其他国家的帐户购买游戏 1.在帐户中设置您的国家/地区。 -前往https://accounts.nintendo.com。 -登录。 -如果您没有帐户，请创建一个。 2.编辑上方的“用户信息”→国家（地区）。 3.更改您想要的国家。 4.准备国际信用卡。 5.从Nintendo游戏控制台进入eShop。 并且您将不得不再次登录更改的国家。 6.语言将更改为相应的国家/地区。 获取有关Google翻译的帮助。购买游戏后，它将以原始语言在控制台上提供。 7.在控制台中的eShop上找到游戏并用国际信用卡完成付款。 8.您可以在主屏幕上下载游戏。
